beaker/results/beaker-b.txt
[OVERALL], RunTime(ms), 4756
[OVERALL], Throughput(ops/sec), 210.26072329688813
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 18
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.37846930193439865
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 26
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.5466778805719091
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 44
[TOTAL_GC_TIME_%], Time(%), 0.9251471825063078
[READ], Operations, 0
[READ], AverageLatency(us), NaN
[READ], MinLatency(us), 9223372036854775807
[READ], MaxLatency(us), 0
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 0
[READ], Return=ERROR, 964
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 390272.0
[CLEANUP], MinLatency(us), 390144
[CLEANUP], MaxLatency(us), 390399
[CLEANUP], 95thPercentileLatency(us), 390399
[CLEANUP], 99thPercentileLatency(us), 390399
[CLEANUP], 390399, 1.0
[UPDATE], Operations, 36
[UPDATE], AverageLatency(us), 38805.333333333336
[UPDATE], MinLatency(us), 173
[UPDATE], MaxLatency(us), 1385471
[UPDATE], 95thPercentileLatency(us), 638
[UPDATE], 99thPercentileLatency(us), 1385471
[UPDATE], Return=OK, 36
[UPDATE], 173, 1.0
[UPDATE], 179, 1.0
[UPDATE], 199, 1.0
[UPDATE], 207, 1.0
[UPDATE], 219, 1.0
[UPDATE], 222, 1.0
[UPDATE], 226, 1.0
[UPDATE], 229, 1.0
[UPDATE], 234, 1.0
[UPDATE], 236, 1.0
[UPDATE], 237, 1.0
[UPDATE], 248, 1.0
[UPDATE], 252, 1.0
[UPDATE], 258, 1.0
[UPDATE], 263, 1.0
[UPDATE], 265, 1.0
[UPDATE], 276, 1.0
[UPDATE], 284, 2.0
[UPDATE], 288, 1.0
[UPDATE], 292, 1.0
[UPDATE], 300, 1.0
[UPDATE], 339, 2.0
[UPDATE], 388, 1.0
[UPDATE], 391, 1.0
[UPDATE], 405, 1.0
[UPDATE], 414, 1.0
[UPDATE], 435, 1.0
[UPDATE], 537, 1.0
[UPDATE], 551, 2.0
[UPDATE], 614, 1.0
[UPDATE], 638, 1.0
[UPDATE], 1059, 1.0
[UPDATE], 1385471, 1.0
[READ-FAILED], Operations, 964
[READ-FAILED], AverageLatency(us), 1359.9004149377593
[READ-FAILED], MinLatency(us), 88
[READ-FAILED], MaxLatency(us), 1084415
[READ-FAILED], 95thPercentileLatency(us), 506
[READ-FAILED], 99thPercentileLatency(us), 1304
[READ-FAILED], 88, 1.0
[READ-FAILED], 89, 1.0
[READ-FAILED], 93, 2.0
[READ-FAILED], 94, 1.0
[READ-FAILED], 95, 1.0
[READ-FAILED], 97, 1.0
[READ-FAILED], 98, 2.0
[READ-FAILED], 99, 2.0
[READ-FAILED], 100, 2.0
[READ-FAILED], 101, 2.0
[READ-FAILED], 102, 6.0
[READ-FAILED], 103, 5.0
[READ-FAILED], 104, 1.0
[READ-FAILED], 105, 6.0
[READ-FAILED], 106, 2.0
[READ-FAILED], 107, 7.0
[READ-FAILED], 108, 1.0
[READ-FAILED], 109, 2.0
[READ-FAILED], 110, 7.0
[READ-FAILED], 111, 2.0
[READ-FAILED], 112, 9.0
[READ-FAILED], 113, 4.0
[READ-FAILED], 114, 4.0
[READ-FAILED], 115, 4.0
[READ-FAILED], 116, 4.0
[READ-FAILED], 117, 6.0
[READ-FAILED], 118, 3.0
[READ-FAILED], 119, 6.0
[READ-FAILED], 120, 8.0
[READ-FAILED], 121, 5.0
[READ-FAILED], 122, 8.0
[READ-FAILED], 123, 11.0
[READ-FAILED], 124, 11.0
[READ-FAILED], 125, 9.0
[READ-FAILED], 126, 7.0
[READ-FAILED], 127, 13.0
[READ-FAILED], 128, 10.0
[READ-FAILED], 129, 7.0
[READ-FAILED], 130, 7.0
[READ-FAILED], 131, 12.0
[READ-FAILED], 132, 7.0
[READ-FAILED], 133, 7.0
[READ-FAILED], 134, 14.0
[READ-FAILED], 135, 9.0
[READ-FAILED], 136, 10.0
[READ-FAILED], 137, 16.0
[READ-FAILED], 138, 3.0
[READ-FAILED], 139, 13.0
[READ-FAILED], 140, 8.0
[READ-FAILED], 141, 11.0
[READ-FAILED], 142, 9.0
[READ-FAILED], 143, 12.0
[READ-FAILED], 144, 13.0
[READ-FAILED], 145, 8.0
[READ-FAILED], 146, 16.0
[READ-FAILED], 147, 6.0
[READ-FAILED], 148, 6.0
[READ-FAILED], 149, 5.0
[READ-FAILED], 150, 12.0
[READ-FAILED], 151, 5.0
[READ-FAILED], 152, 4.0
[READ-FAILED], 153, 7.0
[READ-FAILED], 154, 7.0
[READ-FAILED], 155, 7.0
[READ-FAILED], 156, 4.0
[READ-FAILED], 157, 5.0
[READ-FAILED], 158, 7.0
[READ-FAILED], 159, 9.0
[READ-FAILED], 160, 7.0
[READ-FAILED], 161, 10.0
[READ-FAILED], 162, 9.0
[READ-FAILED], 163, 7.0
[READ-FAILED], 164, 8.0
[READ-FAILED], 165, 9.0
[READ-FAILED], 166, 7.0
[READ-FAILED], 167, 5.0
[READ-FAILED], 168, 6.0
[READ-FAILED], 169, 4.0
[READ-FAILED], 170, 5.0
[READ-FAILED], 171, 5.0
[READ-FAILED], 172, 6.0
[READ-FAILED], 173, 5.0
[READ-FAILED], 174, 3.0
[READ-FAILED], 175, 6.0
[READ-FAILED], 176, 10.0
[READ-FAILED], 177, 7.0
[READ-FAILED], 178, 3.0
[READ-FAILED], 179, 3.0
[READ-FAILED], 180, 7.0
[READ-FAILED], 181, 6.0
[READ-FAILED], 182, 8.0
[READ-FAILED], 183, 4.0
[READ-FAILED], 184, 4.0
[READ-FAILED], 185, 5.0
[READ-FAILED], 186, 3.0
[READ-FAILED], 187, 5.0
[READ-FAILED], 188, 4.0
[READ-FAILED], 189, 3.0
[READ-FAILED], 190, 1.0
[READ-FAILED], 191, 2.0
[READ-FAILED], 192, 5.0
[READ-FAILED], 193, 6.0
[READ-FAILED], 194, 3.0
[READ-FAILED], 195, 3.0
[READ-FAILED], 196, 2.0
[READ-FAILED], 197, 4.0
[READ-FAILED], 198, 2.0
[READ-FAILED], 199, 1.0
[READ-FAILED], 200, 4.0
[READ-FAILED], 201, 1.0
[READ-FAILED], 202, 2.0
[READ-FAILED], 203, 5.0
[READ-FAILED], 204, 2.0
[READ-FAILED], 205, 2.0
[READ-FAILED], 207, 1.0
[READ-FAILED], 208, 5.0
[READ-FAILED], 209, 4.0
[READ-FAILED], 210, 2.0
[READ-FAILED], 211, 2.0
[READ-FAILED], 212, 3.0
[READ-FAILED], 213, 3.0
[READ-FAILED], 214, 1.0
[READ-FAILED], 215, 7.0
[READ-FAILED], 216, 4.0
[READ-FAILED], 217, 1.0
[READ-FAILED], 218, 1.0
[READ-FAILED], 219, 1.0
[READ-FAILED], 220, 1.0
[READ-FAILED], 221, 4.0
[READ-FAILED], 222, 4.0
[READ-FAILED], 223, 1.0
[READ-FAILED], 226, 1.0
[READ-FAILED], 227, 1.0
[READ-FAILED], 228, 5.0
[READ-FAILED], 229, 5.0
[READ-FAILED], 230, 1.0
[READ-FAILED], 231, 4.0
[READ-FAILED], 232, 1.0
[READ-FAILED], 234, 2.0
[READ-FAILED], 235, 3.0
[READ-FAILED], 236, 2.0
[READ-FAILED], 237, 4.0
[READ-FAILED], 238, 3.0
[READ-FAILED], 239, 1.0
[READ-FAILED], 241, 1.0
[READ-FAILED], 242, 1.0
[READ-FAILED], 244, 2.0
[READ-FAILED], 245, 5.0
[READ-FAILED], 246, 1.0
[READ-FAILED], 247, 2.0
[READ-FAILED], 248, 1.0
[READ-FAILED], 250, 1.0
[READ-FAILED], 251, 4.0
[READ-FAILED], 252, 2.0
[READ-FAILED], 253, 2.0
[READ-FAILED], 254, 3.0
[READ-FAILED], 255, 1.0
[READ-FAILED], 256, 4.0
[READ-FAILED], 257, 4.0
[READ-FAILED], 260, 2.0
[READ-FAILED], 261, 1.0
[READ-FAILED], 262, 1.0
[READ-FAILED], 266, 1.0
[READ-FAILED], 267, 1.0
[READ-FAILED], 268, 1.0
[READ-FAILED], 269, 2.0
[READ-FAILED], 270, 2.0
[READ-FAILED], 271, 1.0
[READ-FAILED], 272, 1.0
[READ-FAILED], 273, 2.0
[READ-FAILED], 274, 4.0
[READ-FAILED], 275, 5.0
[READ-FAILED], 280, 2.0
[READ-FAILED], 281, 2.0
[READ-FAILED], 282, 1.0
[READ-FAILED], 285, 4.0
[READ-FAILED], 286, 1.0
[READ-FAILED], 287, 1.0
[READ-FAILED], 288, 1.0
[READ-FAILED], 291, 2.0
[READ-FAILED], 296, 1.0
[READ-FAILED], 302, 3.0
[READ-FAILED], 303, 1.0
[READ-FAILED], 304, 1.0
[READ-FAILED], 307, 1.0
[READ-FAILED], 311, 2.0
[READ-FAILED], 312, 2.0
[READ-FAILED], 314, 4.0
[READ-FAILED], 315, 1.0
[READ-FAILED], 316, 1.0
[READ-FAILED], 317, 1.0
[READ-FAILED], 320, 2.0
[READ-FAILED], 321, 1.0
[READ-FAILED], 325, 1.0
[READ-FAILED], 328, 2.0
[READ-FAILED], 331, 1.0
[READ-FAILED], 332, 1.0
[READ-FAILED], 333, 1.0
[READ-FAILED], 336, 1.0
[READ-FAILED], 337, 1.0
[READ-FAILED], 339, 2.0
[READ-FAILED], 341, 1.0
[READ-FAILED], 342, 2.0
[READ-FAILED], 346, 2.0
[READ-FAILED], 349, 1.0
[READ-FAILED], 350, 1.0
[READ-FAILED], 351, 1.0
[READ-FAILED], 358, 3.0
[READ-FAILED], 359, 1.0
[READ-FAILED], 361, 1.0
[READ-FAILED], 362, 1.0
[READ-FAILED], 364, 1.0
[READ-FAILED], 368, 1.0
[READ-FAILED], 370, 2.0
[READ-FAILED], 371, 1.0
[READ-FAILED], 373, 1.0
[READ-FAILED], 374, 2.0
[READ-FAILED], 378, 1.0
[READ-FAILED], 379, 2.0
[READ-FAILED], 383, 1.0
[READ-FAILED], 384, 1.0
[READ-FAILED], 386, 1.0
[READ-FAILED], 387, 1.0
[READ-FAILED], 392, 2.0
[READ-FAILED], 393, 1.0
[READ-FAILED], 394, 1.0
[READ-FAILED], 395, 1.0
[READ-FAILED], 402, 2.0
[READ-FAILED], 406, 1.0
[READ-FAILED], 409, 2.0
[READ-FAILED], 415, 1.0
[READ-FAILED], 416, 1.0
[READ-FAILED], 418, 3.0
[READ-FAILED], 423, 1.0
[READ-FAILED], 426, 1.0
[READ-FAILED], 430, 1.0
[READ-FAILED], 434, 1.0
[READ-FAILED], 437, 1.0
[READ-FAILED], 444, 2.0
[READ-FAILED], 449, 2.0
[READ-FAILED], 450, 1.0
[READ-FAILED], 455, 1.0
[READ-FAILED], 456, 1.0
[READ-FAILED], 457, 1.0
[READ-FAILED], 459, 1.0
[READ-FAILED], 463, 2.0
[READ-FAILED], 464, 1.0
[READ-FAILED], 468, 1.0
[READ-FAILED], 469, 1.0
[READ-FAILED], 470, 1.0
[READ-FAILED], 474, 1.0
[READ-FAILED], 481, 2.0
[READ-FAILED], 489, 1.0
[READ-FAILED], 490, 1.0
[READ-FAILED], 492, 1.0
[READ-FAILED], 493, 1.0
[READ-FAILED], 503, 1.0
[READ-FAILED], 505, 1.0
[READ-FAILED], 506, 1.0
[READ-FAILED], 508, 1.0
[READ-FAILED], 511, 1.0
[READ-FAILED], 512, 2.0
[READ-FAILED], 524, 1.0
[READ-FAILED], 527, 1.0
[READ-FAILED], 535, 1.0
[READ-FAILED], 539, 1.0
[READ-FAILED], 540, 1.0
[READ-FAILED], 543, 1.0
[READ-FAILED], 564, 1.0
[READ-FAILED], 574, 1.0
[READ-FAILED], 580, 1.0
[READ-FAILED], 581, 1.0
[READ-FAILED], 583, 1.0
[READ-FAILED], 588, 1.0
[READ-FAILED], 600, 1.0
[READ-FAILED], 602, 1.0
[READ-FAILED], 612, 1.0
[READ-FAILED], 620, 1.0
[READ-FAILED], 635, 1.0
[READ-FAILED], 667, 1.0
[READ-FAILED], 675, 1.0
[READ-FAILED], 712, 1.0
[READ-FAILED], 734, 1.0
[READ-FAILED], 778, 1.0
[READ-FAILED], 808, 1.0
[READ-FAILED], 844, 1.0
[READ-FAILED], 849, 1.0
[READ-FAILED], 889, 1.0
[READ-FAILED], 936, 1.0
[READ-FAILED], 975, 1.0
[READ-FAILED], 1036, 1.0
[READ-FAILED], 1109, 1.0
[READ-FAILED], 1154, 1.0
[READ-FAILED], 1193, 1.0
[READ-FAILED], 1277, 1.0
[READ-FAILED], 1304, 1.0
[READ-FAILED], 1348, 1.0
[READ-FAILED], 1659, 1.0
[READ-FAILED], 1819, 1.0
[READ-FAILED], 1925, 1.0
[READ-FAILED], 2253, 1.0
[READ-FAILED], 3253, 1.0
[READ-FAILED], 3503, 1.0
[READ-FAILED], 3773, 1.0
[READ-FAILED], 5735, 1.0
[READ-FAILED], 1084415, 1.0